org/articles/posttraining.org
#+TITLE: Post-Training

* How To Raise a Claude

Tulu 3 fully open post-training https://arxiv.org/pdf/2411.15124

How language model post-training is done today https://youtube.com/watch?v=6yIMb0K-aS4

Anthropic HHH https://arxiv.org/pdf/2112.00861

Anthropic RLHF https://arxiv.org/pdf/2204.05862

Anthropic constitutional AI https://arxiv.org/pdf/2212.08073

Claude's Character https://www.anthropic.com/research/claude-character

Qwen PRM https://x.com/natolambert/status/1879021891480170563

Meta large language model compiler https://arxiv.org/pdf/2407.02524

RL on incorrect synthetic data scales efficiency https://arxiv.org/abs/2406.14532

self-rewarding language models https://arxiv.org/abs/2401.10020

