articles/posttraining.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-23 Wed 15:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Post-Training</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="https://planetbanatt.net/css/default_20240614.css" />
<link rel="shortcut icon" type="image/jpg" href="https://planetbanatt.net/favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee/index.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">Post-Training</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge615a30">How To Raise a Claude</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge615a30" class="outline-1">
<h1 id="orge615a30">How To Raise a Claude</h1>
<div class="outline-text-1" id="text-orge615a30">
<p>
Tulu 3 fully open post-training <a href="https://arxiv.org/pdf/2411.15124">https://arxiv.org/pdf/2411.15124</a>
</p>

<p>
How language model post-training is done today <a href="https://youtube.com/watch?v=6yIMb0K-aS4">https://youtube.com/watch?v=6yIMb0K-aS4</a>
</p>

<p>
Anthropic HHH <a href="https://arxiv.org/pdf/2112.00861">https://arxiv.org/pdf/2112.00861</a>
</p>

<p>
Anthropic RLHF <a href="https://arxiv.org/pdf/2204.05862">https://arxiv.org/pdf/2204.05862</a>
</p>

<p>
Anthropic constitutional AI <a href="https://arxiv.org/pdf/2212.08073">https://arxiv.org/pdf/2212.08073</a>
</p>

<p>
Claude's Character <a href="https://www.anthropic.com/research/claude-character">https://www.anthropic.com/research/claude-character</a>
</p>

<p>
Qwen PRM <a href="https://x.com/natolambert/status/1879021891480170563">https://x.com/natolambert/status/1879021891480170563</a>
</p>

<p>
Meta large language model compiler <a href="https://arxiv.org/pdf/2407.02524">https://arxiv.org/pdf/2407.02524</a>
</p>

<p>
RL on incorrect synthetic data scales efficiency <a href="https://arxiv.org/abs/2406.14532">https://arxiv.org/abs/2406.14532</a>
</p>

<p>
self-rewarding language models <a href="https://arxiv.org/abs/2401.10020">https://arxiv.org/abs/2401.10020</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
